In [1]:
#import the necessary libraries
import pandas as pd
import numpy as np

In [2]:
#load the dataset
df=pd.read_csv('Salary.csv')

In [3]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [4]:
df.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [5]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 544.0 bytes

In [7]:
#data analysis  check null values
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [9]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [13]:
x=df.drop('Salary',axis=1).values
y=df['Salary'].values

In [14]:
model.fit(x,y)

LinearRegression()

In [15]:
y_pred = model.predict(x)

In [17]:
from sklearn.metrics import mean_squared_error,r2_score
print("Mean Squared Error : ",mean_squared_error(y_pred,y,squared=False))
print("R2 Square : ",r2_score(y_pred,y))

Mean Squared Error :  5592.043608760662
R2 Square :  0.955020600755191

In [18]:
print(model.coef_)

[9449.96232146]

In [20]:
import pickle
pickle.dump(model,open('Final_model.pkl','wb'))

In [21]:
loaded_model=pickle.load(open('Final_model.pkl','rb'))

In [25]:
pred=loaded_model.predict([[0.0]])
pred

array([25792.20019867])